In [1]:
import pandas as pd

In [6]:
s1 = pd.Series([45,76,87,43,97,56,85])

In [7]:
type(s1)

pandas.core.series.Series

In [8]:
print(s1)

0    45
1    76
2    87
3    43
4    97
5    56
6    85
dtype: int64

In [11]:
s2 = pd.Series([45,76,87,43,97,56,85], index = ["Rohan","Adi","Shrey","Kulwendra","Tanmay","Mayank","Monu"])

In [12]:
s2

Rohan        45
Adi          76
Shrey        87
Kulwendra    43
Tanmay       97
Mayank       56
Monu         85
dtype: int64

In [14]:
s2["Shrey"]

87

In [15]:
s2["Rohan"]

45

In [18]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

df = pd.DataFrame(data)
df

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [19]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [20]:
df.columns

Index(['name', 'age', 'city'], dtype='object')